{
  "es": {
    "experience": [
      {
        "id": 1,
        "company": "Smartclip Spain",
        "position": "Sofware Engineer",
        "date": "2023 - Presente",
        "responsabilities": [
          "Actualmente, aporto mi experiencia para optimizar el rendimiento y los KPIs de campañas publicitarias y otras cositas más. Además, he dejado mi marca en roles anteriores como Especialista en Front-end y Tecnología de Video, destacándome en la integración de contenido y la mejora del rendimiento a través de la refactorización de código."
        ]
      },
      {
        "id": 2,
        "company": "Smartclip Spain",
        "position": "Front-end Developer & Video Tech Specialist",
        "date": "2022 - 2023",
        "responsabilities": [
          "Desarrollar herramientas de trabajo utilizando PHP, Vite, React, JavaScript, Tailwind y CSS para crear aplicaciones web interactivas y atractivas",
          "Implementé la compilación y transpilación del código utilizando webpack y babel para mejorar la compatibilidad con múltiples navegadores y asegurar un rendimiento óptimo",
          "Realicé refactorizaciones de código utilizando las mejores prácticas de programación, optimizando algoritmos y mejorando la eficiencia del código para lograr un rendimiento óptimo de las aplicaciones",
          "Utilicé Git para gestionar el repositorio de trabajo, permitiendo un control de versiones efectivo y colaboración en equipo",
          "Realicé integraciones de tipo Instream y Oustream, trabajando con tecnologías de video como HTML5 Video, Video.js, JW Player y Google IMA SDK para integrar anuncios publicitarios en videos de manera efectiva y sin interrupciones"
        ]
      },
      {
        "id": 3,
        "company": "El Economista",
        "position": "Front-end Developer",
        "date": "2021 - 2022",
        "responsabilities": [
          "Implementé mejoras en las métricas de Web Vitals, siguiendo buenas prácticas de desarrollo para asegurar un rendimiento óptimo y una mejor experiencia de usuario.",
          "Desarrollé landing pages atractivas y funcionales, utilizando HTML, CSS y JavaScript para crear interfaces interactivas y atractivas.",
          "Utilicé Figma para realizar diseños y prototipos, colaborando con el equipo de diseño para crear experiencias visuales e impactantes para el usuario.",
          "Creé WebComponents utilizando tecnologías como HTML, CSS y JavaScript para modularizar y reutilizar componentes en el desarrollo de aplicaciones web.",
          "Colaboré con el equipo en la implementación de nuevas funcionalidades en el sitio web, aportando ideas y soluciones técnicas para mejorar la experiencia de usuario.",
          "Realicé el maquetado de landing pages, secciones web y herramientas web utilizando HTML, CSS y frameworks como Bootstrap, asegurando una apariencia visualmente atractiva y una navegación intuitiva.",
          "Refactoricé código existente, optimizando algoritmos y estructuras de datos para mejorar el rendimiento, la eficiencia y la mantenibilidad del código base.",
          "Apliqué buenas prácticas de desarrollo, siguiendo estándares de codificación, documentación clara y uso de herramientas de análisis de código estático para asegurar la calidad del software.",
          "Mejoré la visibilidad de la publicidad en el sitio implementando buenas prácticas de desarrollo, como la carga diferida de anuncios, el uso de formatos de anuncios responsivos y la optimización de código para mejorar la visibilidad."
        ]
      },
      {
        "id": 4,
        "company": "PS-Lab",
        "position": "Front-end Developer",
        "date": "2020 - 2021",
        "responsabilities": [
          "Desarrollé aplicaciones web utilizando HTML, CSS, JavaScript y frameworks como Bootstrap, React y Vue, asegurando una apariencia visualmente atractiva y una navegación intuitiva.",
          "Implementé mejoras en las métricas de Web Vitals, siguiendo buenas prácticas de desarrollo para asegurar un rendimiento óptimo y una mejor experiencia de usuario.",
          "Realicé el maquetado de landing pages, secciones web y herramientas web utilizando HTML, CSS y frameworks como Bootstrap, asegurando una apariencia visualmente atractiva y una navegación intuitiva.",
          "Refactoricé código existente, optimizando algoritmos y estructuras de datos para mejorar el rendimiento, la eficiencia y la mantenibilidad del código base.",
          "Apliqué buenas prácticas de desarrollo, siguiendo estándares de codificación, documentación clara y uso de herramientas de análisis de código estático para asegurar la calidad del software.",
          "Mejoré la visibilidad de la publicidad en el sitio implementando buenas prácticas de desarrollo, como la carga diferida de anuncios, el uso de formatos de anuncios responsivos y la optimización de código para mejorar la visibilidad."
        ]
      },
      {
        "id": 5,
        "company": "Freelance",
        "position": "Front-end Developer",
        "date": "2018 - 2020",
        "responsabilities": [
          "Llevar el diseño a la web usando HTML, CSS y JavaScript",
          "Manejo de Boostrap",
          "Manejo de JQuery",
          "Manejo de Sass",
          "Manejo de Git (control de versiones)",
          "Web scrapping",
          "Conocimento y Manejo de ReactJS, Redux, Styled Component",
          "Proyectos: más de 10 proyectos en mi portafolio entre ellos, GIFsApp, Dashsocialmedia, FlagsApp."
        ]
      }
    ],
    "projects": [
      {
        "id": 1,
        "name": "To-do",
        "description": "Recupera tu tranquilidad y claridad al instante. Organiza tus tareas de forma eficiente con nuestra innovadora app. Libérate del caos mental y experimenta el poder de la productividad simplificada.",
        "image": "./todoApp.png",
        "url": "https://todo-best.vercel.app/",
        "github": "https://github.com/eduardoguette/to-do",
        "colaborators": [
          {
            "name": "Eduardo Guette",
            "img": "https://avatars.githubusercontent.com/u/61714979?v=4",
            "url": "https://github.com/eduardoguette"
          }
        ]
      },
      {
        "id": 2,
        "name": "Start home",
        "description": "Una página de inicio rápido, donde además de ser un buscador, podrás guardar notas y al mismo tiempo tener hermosos paisajes de fondo.",
        "image": "./startHome.jpeg",
        "url": "https://start-home.netlify.app/",
        "github": "https://github.com/eduardoguette/start-home",
        "colaborators": [
          {
            "name": "Eduardo Guette",
            "img": "https://avatars.githubusercontent.com/u/61714979?v=4",
            "url": "https://github.com/eduardoguette"
          }
        ]
      },
      {
        "id": 3,
        "name": "Hacktoberfest 2022 - midudev",
        "description": "La Hacktoberfest es un evento anual organizado por DigitalOcean y DEV, que consiste en contribuir a proyectos de código abierto y ganar una camiseta gratis.",
        "image": "./hacktoberfest.png",
        "url": "https://hacktoberfest-2022.vercel.app/entry/eduardoguette",
        "github": "https://github.com/midudev/password-generator",
        "colaborators": [
          {
            "name": "Eduardo Guette",
            "img": "https://avatars.githubusercontent.com/u/61714979?v=4",
            "url": "https://github.com/eduardoguette"
          }
        ]
      },
      {
        "id": 4,
        "name": "Miduconf",
        "description": "Conferencia de desarrollo web organizada por midudev. En esta oportunidad apoye la conferencia con una pull request para la página web. ",
        "image": "./miduconf.png",
        "url": "https://eduardoguette.github.io/GIFsApp/",
        "github": "https://github.com/eduardoguette/miduconf-website",
        "colaborators": [
          {
            "name": "Eduardo Guette",
            "img": "https://avatars.githubusercontent.com/u/61714979?v=4",
            "url": "https://github.com/eduardoguette"
          },
          {
            "name": "Miguel Ángel Durán",
            "img": "https://avatars.githubusercontent.com/u/1561955?v=4",
            "url": "https://github.com/midudev"
          }
        ]
      }
    ]
  },
  "en": {
    "experience": [
      {
        "id": 1,
        "company": "Smartclip Spain",
        "position": "Sofware Engineer",
        "date": "2023 - Present",
        "responsabilities": [
          "Currently, I contribute my experience to optimize the performance and KPIs of advertising campaigns and other little things. In addition, I have left my mark in previous roles as a Front-end and Video Technology Specialist, standing out in content integration and performance improvement through code refactoring."
        ]
      },
      {
        "id": 2,
        "company": "Smartclip Spain",
        "position": "Front-end Developer & Video Tech Specialist",
        "date": "2022 - 2023",
        "responsabilities": [
          "Develop work tools using PHP, Vite, React, JavaScript, Tailwind and CSS to create interactive and attractive web applications",
          "I implemented the compilation and transpilation of the code using webpack and babel to improve compatibility with multiple browsers and ensure optimal performance",
          "I performed code refactoring using best programming practices, optimizing algorithms and improving code efficiency to achieve optimal application performance",
          "I used Git to manage the working repository, allowing effective version control and team collaboration",
          "I performed Instream and Oustream type integrations, working with video technologies such as HTML5 Video, Video.js, JW Player and Google IMA SDK to integrate advertising ads into videos effectively and without interruptions"
        ]
      },
      {
        "id": 3,
        "company": "El Economista",
        "position": "Front-end Developer",
        "date": "2021 - 2022",
        "responsabilities": [
          "I implemented improvements in the Web Vitals metrics, following good development practices to ensure optimal performance and an improved user experience.",
          "I developed attractive and functional landing pages, using HTML, CSS and JavaScript to create interactive and compelling interfaces.",
          "I used Figma to make designs and prototypes, collaborating with the design team to create impactful visual and user experiences.",
          "I created WebComponents using technologies such as HTML, CSS and JavaScript to modularize and reuse components in the development of web applications.",
          "I collaborated with the team in the implementation of new functionalities on the website, contributing ideas and technical solutions to improve the user experience.",
          "I performed the layout of landing pages, web sections and web tools using HTML, CSS and frameworks such as Bootstrap, ensuring a visually attractive appearance and intuitive navigation.",
          "I refactored existing code, optimizing algorithms and data structures to improve performance, efficiency and maintainability of the base code.",
          "I applied good development practices, following coding standards, clear documentation and use of static code analysis tools to ensure software quality.",
          "I improved the visibility of advertising on the site by implementing good development practices, such as deferred loading of ads, the use of responsive ad formats and code optimization to improve viewability."
        ]
      },
      {
        "id": 4,
        "company": "PS-Lab",
        "position": "Front-end Developer",
        "date": "2020 - 2021",
        "responsabilities": [
          "I participated in the optimization of the website, applying the best development practices and taking into account Google web vitals metrics, such as LCP (Largest Contentful Paint), FID (First Input Delay) and CLS (Cumulative Layout Shift).",
          "I used HTML5, CSS and SASS to create visually attractive and responsive components and landing pages, ensuring a smooth and consistent user experience on different devices.",
          "I implemented interactive features using JavaScript, taking advantage of its ability to manipulate the DOM and improve the interactivity of the website.",
          "I used Highcharts and D3.js, two popular data visualization libraries, to represent graphs and present information in a clear and understandable way.",
          "I took advantage of the Bootstrap framework to speed up development and ensure a consistent and professional visual appearance throughout the website. I used its components and predefined styles to achieve a quick and efficient implementation."
        ]
      }
    ],
    "projects": [
      {
        "id": 1,
        "name": "To-do",
        "description": "Reclaim your peace of mind and clarity instantly. Organize your tasks efficiently with our innovative app. Free yourself from mental chaos and experience the power of simplified productivity.",
        "image": "./todoApp.png",
        "url": "https://todo-best.vercel.app/",
        "github": "https://github.com/eduardoguette/to-do",
        "colaborators": [
          {
            "name": "Eduardo Guette",
            "img": "https://avatars.githubusercontent.com/u/61714979?v=4",
            "url": "https://github.com/eduardoguette"
          }
        ]
      },
      {
        "id": 2,
        "name": "Start home",
        "description": "A quick home page, where in addition to being a search engine, you can save notes and at the same time have beautiful landscapes in the background.",
        "image": "./startHome.jpeg",
        "url": "https://start-home.netlify.app/",
        "github": "https://github.com/eduardoguette/start-home",
        "colaborators": [
          {
            "name": "Eduardo Guette",
            "img": "https://avatars.githubusercontent.com/u/61714979?v=4",
            "url": "https://github.com/eduardoguette"
          }
        ]
      },
      {
        "id": 3,
        "name": "Hacktoberfest 2022 - midudev",
        "description": "This is a project to celebrate Hacktoberfest 2022. Feel free to send your pull requests to this repository and participate in the open source festivity!",
        "image": "./hacktoberfest.png",
        "url": "https://hacktoberfest-2022.vercel.app/entry/eduardoguette",
        "github": "https://github.com/midudev/password-generator",
        "colaborators": [
          {
            "name": "Eduardo Guette",
            "img": "https://avatars.githubusercontent.com/u/61714979?v=4",
            "url": "https://github.com/eduardoguette"
          }
        ]
      },
      {
        "id": 4,
        "name": "Miduconf",
        "description": "Miduconf is a conference about the latest news in the web development world. It is organized by midudev and it is celebrated in Madrid, Spain.",
        "image": "./miduconf.png",
        "url": "https://eduardoguette.github.io/GIFsApp/",
        "github": "https://github.com/eduardoguette/miduconf-website",
        "colaborators": [
          {
            "name": "Eduardo Guette",
            "img": "https://avatars.githubusercontent.com/u/61714979?v=4",
            "url": "https://github.com/eduardoguette"
          },
          {
            "name": "Miguel Ángel Durán",
            "img": "https://avatars.githubusercontent.com/u/1561955?v=4",
            "url": "https://github.com/midudev"
          }
        ]
      }
    ]
  }
}
